In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('https://raw.githubusercontent.com/codebasics/math-for-machine-learning/main/4_mean_percentile/income.csv',names=["name","income"],skiprows=[0])

In [3]:
#way to rename column

# df.rename(columns = {'old_col1':'new_col1', 'old_col2':'new_col2'}, inplace = True)

In [4]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [5]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [6]:
df.income.quantile(.75,interpolation="lower")

7500

In [7]:
df.income.quantile(.75)

7750.0

In [8]:
df.income.quantile(1)

10000000.0

In [9]:
p_99=df.income.quantile(.99)

In [10]:
outlier=df[df.income>p_99]

In [11]:
outlier

        name    income
6  Elon Musk  10000000

In [12]:
no_outlier=df[df.income<=p_99]

In [13]:
no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [14]:
#system 1
#df["income"][df["income"]==7500]=np.NaN
df["income"][3]=np.NaN

C:\Users\ABDURR~1\AppData\Local\Temp/ipykernel_11968/503565543.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["income"][3]=np.NaN
C:\Users\Abdur rahim nishad\anaconda3\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [38]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [16]:
# df.iloc[3]["income"]=np.NaN

In [17]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [18]:
df.income.mean()

1671666.6666666667

In [19]:
df_new=df.fillna(df.income.mean())

In [20]:
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [21]:
df.income.median()

6500.0

In [22]:
df_new=df.fillna(df.income.median())

In [23]:
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [24]:
# df_new["name"]=df_new["name"].replace("o","i")
df_new["name"]=df_new["name"].apply(lambda x:x.replace("o","i"))

In [25]:
df_new

        name      income
0        Rib      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sifia      6500.0
4      Mihan      8000.0
5        Tai      7000.0
6  Elin Musk  10000000.0

In [26]:
df_new['name']=df_new['name'].replace("o","u")

In [27]:
df_new

        name      income
0        Rib      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sifia      6500.0
4      Mihan      8000.0
5        Tai      7000.0
6  Elin Musk  10000000.0

In [28]:
df_new['name']=df_new['name'].str.replace("u","o")

In [29]:
df_new

        name      income
0        Rib      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sifia      6500.0
4      Mihan      8000.0
5        Tai      7000.0
6  Elin Mosk  10000000.0

In [30]:
df.iloc[:-1]

    name  income
0    Rob  5000.0
1  Rafiq  6000.0
2   Nina  4000.0
3  Sofia     NaN
4  Mohan  8000.0
5    Tao  7000.0

In [31]:
df_new['name']=df_new['name'].str.replace("b","o")

In [32]:
df_new['name']

0          Rio
1        Rafiq
2         Nina
3        Sifia
4        Mihan
5          Tai
6    Elin Mosk
Name: name, dtype: object

In [33]:
df_new

        name      income
0        Rio      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sifia      6500.0
4      Mihan      8000.0
5        Tai      7000.0
6  Elin Mosk  10000000.0

In [34]:
df_new['name']=df_new['name'].str.replace("r","o")